/* *********************************************************************************************************************** */
/*  UTC Header                                                                                                             */
/*                                                        ::::::::::::::::::::       :::    ::: :::::::::::  ::::::::      */
/*     boj_1912.cpp                                       ::::::::::::::::::::       :+:    :+:     :+:     :+:    :+:     */
/*                                                        ::::::::::::::+++#####+++  +:+    +:+     +:+     +:+            */
/*     By: chemicat53 <daumtto53@gmail.com>               ::+++##############+++     +:+    +:+     +:+     +:+            */
/*     daumtto53@gmail.com                            +++##############+++::::       +#+    +:+     +#+     +#+            */
/*                                                      +++##+++::::::::::::::       +#+    +:+     +#+     +#+            */
/*                                                        ::::::::::::::::::::       +#+    +#+     +#+     +#+            */
/*                                                        ::::::::::::::::::::       #+#    #+#     #+#     #+#    #+#     */
/*     Update: 2021/08/20 22:44:38 by chemicat53          ::::::::::::::::::::        ########      ###      ######## .fr  */
/*                                                                                                                         */
/* *********************************************************************************************************************** */

#include <iostream>
#include <algorithm>

/*
	partial_sum : i == 0 부터 i == k 까지의 부분합의 최대값.
*/
using namespace std;
int		main()
{
	int		integers[100000];
	int		n;
	int		partial_sum[100000];
	int		i, j;
	int		max_int;

	cin >> n;
	for (i = 0; i < n; i++)
	{
		cin >> integers[i];
	}
	max_int = integers[0];
	partial_sum[0] = integers[0];
	for (i = 1; i < n; i++)
	{
		partial_sum[i] = max(partial_sum[i - 1] + integers[i], integers[i]);
		max_int = max_int > partial_sum[i] ? max_int : partial_sum[i];
	}
	cout << max_int;
}
